import { Card, CardContent, CardHeader, CardTitle } from "./ui/card";

export function WhyCard() {
  return <Card className="print:hidden">
    <CardHeader>
      <CardTitle>Підготовка звіту для податкової</CardTitle>
    </CardHeader>
    <CardContent className="space-y-2">
      <p><b>Проблема:</b> подаючи звіт ми з одного боку прикріплюємо statement activity звіти, що перевантажені зайвою інформацією, ще й на англійській мові, а з іншого, власне розрахунки ми робимо з flex звітів - що може призвести до непорозумінь та помилок у розрахунках.</p>
      <p><b>Рішення:</b> автоматизувати процес підготовки звіту, використовуючи дані з спеціалізованого звіту для точного та зрозумілого розрахунку податків, а також підготувати необхідні дані для форми Ф1 та pdf файлу з перекладом.</p>
      <p><b>Чому це краще:</b> ми робимо розрахунки на тому самому звіті, що прикріплюватимемо в якості підтверджувального документу до податкової, тим самим зменшуючи ризик помилок та непорозумінь, а також полегшуючи життя інспектору, адже в разі бажання він зможе перевірити розрахунки власноруч.</p>
      <p><b>Як це працює:</b> зі сторони IBKR ми формуємо річний звіт, після чого підвантажуємо його сюду, сайт розпарсить звіт та покаже розрахунки щодо угод та дивідендів, додаток Ф1, та pdf файл з перекладом.</p>
    </CardContent>
  </Card>
}
